Autodesk.Revit.DB.Electrical.PanelScheduleType
This enum declares the panel schedule type.
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleType.Data
Data panel schedule

Autodesk.Revit.DB.Electrical.PanelScheduleType.Switchboard
Switchboard schedule

Autodesk.Revit.DB.Electrical.PanelScheduleType.Branch
Branch panel schedule

Autodesk.Revit.DB.Electrical.PanelScheduleType.Unknown
Unknown panel schedule